---

---
# Где я?????
Добро пожаловать на курс по С++ для чайников, начинать мы будем с полного нуля что-бы даже такой как ты смог понять о чем речь)

---
# История C++: как программисты изобрели велосипед, а потом приделали к нему турбореактивный двигатель
В 1972 году был создан язык программирования С, который позволял написать программу для чего угодно - например, для калькулятора или даже ядерного реактора. В 1983 году Бьёрн Страуструп решил усовершенствовать этот язык, добавив в него объектно-ориентированное программирование (обязательно поговорим про это позже). Так появился C++ — C на стероидах. Первоначально язык назывался C with classes, но в итоге получил своё нынешнее имя — C++. Кстати, "++" — это не смайлик, а оператор инкремента.

---
# Как компьютер понимает ваш код
Когда вы пишете программу, это похоже на написание письма на древнем языке. Перед тем как отправить это «письмо», его проверяет специальная программа — компилятор. Если в коде пропущена точка с запятой или другая важная деталь, компилятор выдаст ошибку, как если бы строгий редактор указал на неправильную пунктуацию в тексте.
Например, если вы пишете строку кода cout << "Я повелитель вселенной!", но забываете добавить точку с запятой в конце, компилятор не сможет правильно обработать эту инструкцию и сообщит об ошибке.

---
# Память компьютера. Что это такое?
Память компьютера — это система хранения данных, включающая быструю, но временную оперативную память (ОЗУ/RAM) для работающих программ и долговременную внешнюю память (HDD/SSD) для файлов, а также кэш-память для процессора

По факту компьютер хранит все наши данные как 01000001
0 и 1 это абстракция того, течет ли ток или нет

Постоянная память компьютера (HDD, SSD, флешки) — медленная, но верная. Будет хранить ваши мемы, игры и «домашку» даже после апокалипсиса. Если бы наш мозг был как HDD, мы бы помнили свои пароли от ВКонтакте десятилетней давности.

Оперативная память — быстрая, но как золотая рыбка. Помнит всё, пока вы в сети, но после перезагрузки удивляется: «А кто вы вообще?»

Хотя оперативка работает быстрее постоянной памяти, её объёмы всегда меньше. Поэтому для сложных вычислений программисты придумывают хитрые алгоритмы и различные уловки для того, чтобы хоть немного её сэкономить. Битва за свободную оперативку бывает жарче, чем за последний кусочек торта! Но об этом мы поговорим позже, когда приступим к решению задач.

---

# Где писать код
Профессиональные среды разработки (IDE)
Это мощные программы, которые устанавливаются на компьютер и предоставляют полный набор инструментов для создания сложных приложений.
- Лично я советую вам скачать Visual Studio. Пожалуй, самая популярная IDE для Windows. Версия Community бесплатна для индивидуальных разработчиков и обучения.
- Visual Studio Code (VS Code Самый популярный редактор в 2026 году. Для работы с C++ в него нужно установить расширение C/C++ от Microsoft и отдельный компилятор (например, MSVC, GCC или Clang)

Как скачать думаю не стоит объяснять, если вы сейчас это читаете значит у вас скорее всего есть интернет. Хороший программист это тот кто умеет искать информацию.
